
создаём перменную палиндром которая поддрерживает аргумент s
создаем переменную tmp и приравниваем её к переменной s
переварачиваем пер
печатаем переменную s и input list
печатаем переменную tmp и reversed list

создаем цикл if в котором сравниваем tmp и s и если они равны
возвращаем правду
иначе
возвращаемся
создаем функцию word которая поддрерживает аргумент n
создаем пустой список result
создаем цикл for i in range с количеством повторений n 
создаем переменную element внутри цикла, она равна вводу пользователя и перед этим выводит слова Enter element
с каждым повторением добавляем в пустой список ввод пользователя

создаем цикл if 
в котором при положительном результате печатаем ф строку result и то что это полиндром
иначе 
печатаем ф строку result и то что это не полиндром
вызываем функцию word 3 раза
вызываем функцию is_palindrome с аргументом s
